Revit 2024 API
BuiltInFailures.StairRampFailures.CannotCreateSideStringer Property
 Can't create one or more Side Stringers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCreateSideStringer { get; }
Visual Basic
Public Shared ReadOnly Property CannotCreateSideStringer As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCreateSideStringer {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace